Repository: debian-ports/defoma
Catalog: man/po4a/po/*.po
Languages: fr

source: I<additional-lines> are added to the file as comments or default rules. Quote each rule or comment with single or double quotations.
fr: Les I<autres-lignes> sont ajoutées au fichier en tant que commentaires ou règles par défaut. Chaque commentaire ou règle doit être encadré par des guillemets simples « ' » ou doubles « " ».

source: Edit the rulefile specified by I<rulename>. After editing, modification is reflected to the related Id cache. In other words, new ids would be added provided by substitutive fonts to the Id cache if a rule is added, and registered ids would be removed from the Id cache if a rule is removed.
fr: Édite le fichier de règles spécifié par I<nom_règle>. Après une édition, les modifications sont reflétées dans la base de référence correspondante. En d'autres termes, les nouveaux identifiants fournis par les polices substituées seront ajoutés à la base de référence si une règle est ajoutée, et les identifiants enregistrés seront retirés de la base de référence si une règle est retirée.

source: Add one or more rules specified by I<rules> to the specified I<rulename>. Quote each rule with single or double quotations.
fr: Ajoute une règle (ou plus) spécifiée par I<règle> à I<nom_règle>. Mettez chaque règle entre guillemets simples ou doubles.

source: Remove one or more rules specified by I<rules> from the specified I<rulename>. Quote each rule with single or double quotations.
fr: Retire une règle (ou plus) spécifiée par I<règle> de I<nom_règle>. Mettez chaque règle entre guillemets simples ou doubles.

source: Check if the rulefile specified by I<rulename> exists. It returns zero when the rulefile exists, and non-zero (actually one) when the rulefile doesn't exist.
fr: Vérifie si le fichier de règles spécifié par I<nom_règle> existe. Zéro est retourné quand le fichier de règles existe, et une valeur non nulle (1 actuellement) lorsque le fichier de règles n'existe pas.

source: 1. Create foo.subst-rule with some comments and default rules.
fr: 1. Création de toto.subst-rule avec des commentaires et des règles par défaut.

source: defoma-subst new-rule foo '# This is a comment. ' \e '# Run defoma-subst edit-rule foo to edit this file.' \e 'Times-Roman --GeneralFamily Roman --Charset,* ISO8859-1' \e 'Kanji-H --GeneralFamily Mincho --Charset,* JISX0208'
fr: defoma-subst new-rule toto '# Ceci est un commentaire. ' \e '# Exécutez defoma-subst edit-rule toto pour éditer ce fichier.' \e 'Times-Roman --GeneralFamily Roman --Charset,* ISO8859-1' \e 'Kanji-H --GeneralFamily Mincho --Charset,* JISX0208'

source: 2. Add some rules to foo.subst-rule.
fr: 2. Ajout de règles à toto.subst-rule

source: defoma-subst add-rule foo \e 'Times-Roman --GeneralFamily Roman --Charset,* ISO8859-1' \e 'Kanji-H --GeneralFamily Mincho --Charset,* JISX0208' \e
fr: defoma-subst add-rule toto \e 'Times-Roman --GeneralFamily Roman --Charset,* ISO8859-1' \e 'Kanji-H --GeneralFamily Mincho --Charset,* JISX0208' \e

source: June 15, 2003
fr: 15 juin 2003

source: defoma-user - Debian Font Manager for users
fr: defoma-user - le gestionnaire de polices Debian pour les utilisateurs

source: B<defoma-user> [I<options>] B<reconfigure>
fr: B<defoma-user> [I<options>] I<reconfigure>

source: I have no idea what B<defoma-user> does just yet. I'm working on it..
fr: Je n'ai aucune idée de ce que fait B<defoma-user>. J'y travaille...

source: Defoma::Subst - Defoma module to handle Subst cache/rule.
fr: Defoma::Subst - module Defoma pour la gestion des caches et des règles de substitution.

source: rulename =E<gt> I<rulename>,
fr: rulename =E<gt> I<nom_règle>,

source: threshold =E<gt> I<threshold>,
fr: threshold =E<gt> I<seuil>,

source: idobject =E<gt> I<id_object>,
fr: idobject =E<gt> I<id_objet>,

source: private =E<gt> I<private_flag> );
fr: private =E<gt> I<drapeau_privé> );

source: defoma_subst_close( I<subst_object> );
fr: defoma_subst_close( I<objet_subst> );

source: defoma_subst_register( I<subst_object>, I<font>, I<realname> );
fr: defoma_subst_register( I<objet_subst>, I<police>, I<nom_réel> );

source: defoma_subst_unregister( I<subst_object>, I<font> I<realname> );
fr: defoma_subst_unregister( I<objet_subst>, I<police> I<nom_réel> );

source: defoma_subst_add_rule( I<subst_object>, I<required_id>, I<rule...> );
fr: defoma_subst_add_rule( I<objet_subst>, I<id_requis>, I<règle...> );

source: defoma_subst_remove_rule( I<subst_object>, I<required_id>, I<rule...> );
fr: defoma_subst_remove_rule( I<objet_subst>, I<id_requis>, I<règle...> );

source: Defoma::Subst is a Defoma module to handle subst-cache and subst-rule. When a certain id is required but not provided as RealName or Alias by any font, fonts which have similar appearance and the same characters should substitute for such a font. Required ids and their information about appearance and charset things (called *rule*) are described in a subst-rule. Defoma::Subst compares such a rule of a certain required id with hints of a substitutive font and calculates the degree of similarity in percentage, and registers the required id and the font with the value as its priority as 'Substituted' type to an id-cache through Defoma::Id module.
fr: Defoma::Subst est un module Defoma qui permet de gérer les caches de substitution (« subst-cache ») et les règles de substitution (« subst-rule »). Lorsqu'un identifiant est requis, mais qu'il n'est ni fourni comme nom réel (RealName) ou Alias d'une police, les polices qui ont une apparence similaire et le même jeu de caractères peuvent se substituer à cette police. Les identifiants requis et les informations concernant leur apparence et leur jeu de caractères sont décrits dans une règle de substitution. Defoma::Subst compare ces règles pour les identifiants requis avec les indications d'une police de substitution et calcule le pourcentage de similitude, il enregistre ensuite l'identifiant requis et la police avec une priorité « Substituted » dans une base de référence à l'aide du module Defoma::Id.

source: subst-rule is mainly edittable by users, which means users edit subst-rule file to add/remove/modify the required ids and their information, but sometimes unedittable by them and modified by a Defoma-configuration script. The former is called B<public> subst-rule and the latter is called B<private> subst-rule.
fr: Les règles de substitution sont en grande partie modifiables par les utilisateurs, ce qui signifie que les utilisateurs peuvent éditer les fichiers de règles de substitution pour ajouter, retirer ou modifier les identifiants et leurs informations. Cependant certains de ces fichiers ne sont pas modifiables et sont gérés par les scripts de configuration Defoma. Ces premières règles de substitution sont dites B<publiques> et ces dernières sont dites B<privées>.

source: subst-cache holds fonts which are candidacies for substituting for required ids. As mentioned above, a rule of a required id and hints of such a font are compared. Hints are not recorded in a subst-cache so retrieved from an id-cache. In addition a required id and its rule are recorded in an subst-rule, so subst-cache, subst-rule and id-cache are strongly linked up. Especially subst-cache and subst-rule are not separatable and Defoma::Subst handles these two through a single united object.
fr: Un cache de substitution contient les polices pouvant se substituer à l'identifiant demandé. Comme indiqué précédemment, une règle de l'identifiant requis et les indications des polices sont comparées. Les indications ne sont pas stockées dans les caches de substitution et sont donc récupérées dans une base de référence. De plus, les identifiants requis et leur règle sont stockés dans des règles de substitution, donc les caches de substitution, les règles de substitution et les bases de références sont fortement liés. Particulièrement les caches de substitution et les règles de substitution, qui ne peuvent pas être séparées, ce qui explique que Defoma::Subst les manipule par l'intermédiaire d'un unique objet.

source: B<defoma_subst_open> is a function used to open a subst-cache and subst-rule specified by I<rulename> and I<private_flag> and returns the I<subst_object> used for further operation. If the subst-rule is private one, set I<private_flag> to non-zero. Otherwise it can be omitted. The subst-rule becomes public. I<id_object> must be specified because subst-cache and subst-rule are strongly linked up to id-cache as mentioned above. Hints of a substitutive font are retrieved from the id-cache specified by the I<id_object>, and required ids described in the subst-rule are registered to the id-cache. I<threshold> prevents fonts that have less degree of similarity from being registered. If a required id is already registered in the id-cache, substitutive fonts whose degree of similarity are less than this I<threshold> are not registered to an id-cache.
fr: B<defoma_subst_open> permet d'ouvrir un cache de substitution et une règle de substitution tous deux spécifiés par I<nom_règle>. Elle prend également un argument I<drapeau_privé> et retourne un I<objet_subst> qui sera utilisé pour les opérations suivantes. Si la règle de substitution est privée, I<drapeau_privé> doit être non nul. Sinon, il peut être omis. La règle devient alors publique. I<id_objet> doit être spécifié car les caches de substitution et les règles de substitution sont fortement liés à une base de référence comme mentionné précédemment. Les indications d'une police de substitution sont récupérées dans la base de référence I<id_objet>, et les identifiants requis décrits dans la règle de substitution sont enregistrés dans la base de référence. Le I<seuil> permet d'empêcher les polices dont le pourcentage de similitude est trop bas d'être enregistrées. Si un identifiant requis est déjà enregistré dans la base de référence, les polices de substitution dont le degré de similitude est plus faible ne sont pas enregistrées dans la base de référence.

source: B<defoma_subst_close> is a function used to close a subst-cache and subst-rule specified by I<subst_object>. Internally it writes the content of cache and rule stored in a memory to files.
fr: B<defoma_subst_close> permet de fermer un cache et une règle de substitution donnés par I<objet_subst>. En interne, ceci permet d'écrire dans un fichier le contenu du cache et de la règle en mémoire.

source: B<defoma_subst_register> is a function used to register a font which is candidate for substituting for required ids to the subst-cache specified by I<subst_object>. RealName of the font must be specified.
fr: B<defoma_subst_register> permet d'enregistrer une police pouvant se substituer à un identifiant requis dans le cache de substitution spécifié par I<objet_subst>. Le nom réel (« RealName ») de la police doit être renseigné.

source: B<defoma_subst_unregister> is a function used to unregister a font from the subst-cache specified by I<subst_object>. RealName can be omitted.
fr: B<defoma_subst_unregister> permet de retirer une police du cache de substitution I<objet_subst>. Le nom réel (RealName) peut être omis.

source: B<defoma_subst_add_rule> is a function used to add a required id and its rule to the subst-rule specified by I<subst_object>.
fr: B<defoma_subst_add_rule> permet d'ajouter un identifiant requis et sa règle à la règle de substitution I<objet_subst>.

source: B<defoma_subst_remove_rule> is a function used to remove a required id and its rule from the subst-rule specified by I<sbst_object>. If I<rule> is omitted, all the rules describing the I<required_id> are removed from the subst-rule. Otherwise only one rule specified by I<rule >andI< required_id > is removed.
fr: B<defoma_subst_remove_rule> permet de retirer un identifiant requis et sa règle de la règle de substitution I<objet_subst>. Si la I<règle> est omise, toutes les règles décrivant l'identifiant requis I<id_requis> sont retirées de la règle de substitution. Sinon, seule une règle spécifiée par I<règle> et I<id_requis> est retirée.

source: 1. Open private subst-rule and subst-rule.
fr: 1. Ouverture d'une règle de substitution privée.

source: 2. Register a substitutive font.
fr: 2. Enregistrement d'une police de substitution.

source: defoma_id_register($Id, type =E<gt> 'real', font =E<gt> $font, id =E<gt> $realname, priority =E<gt> $priority, hints =E<gt> join(' ', @_)); defoma_subst_register($Sb, $font, $realname);
fr: defoma_id_register($Id, type =E<gt> 'real', font =E<gt> $police, id =E<gt> $nom_réel, priority =E<gt> $priorité, hints =E<gt> join(' ', @_)); defoma_subst_register($Sb, $police, $nom_réel);

source: 3. Unregister.
fr: 3. Désenregistrement.

source: defoma_subst_unregister($Id, $font); defoma_id_unregister($Id, 'real', $font);
fr: defoma_subst_unregister($Id, $police); defoma_id_unregister($Id, 'real', $police);

source: 4. Add a rule.
fr: 4. Ajout d'une règle.

source: defoma_subst_add_rule($Sb, 'Helvetica', @hints);
fr: defoma_subst_add_rule($Sb, 'Helvetica', @indications);

source: 5. Remove all rules for Helvetica.
fr: 5. Retrait de toutes les règles pour Helvetica.

source: 20 August 2000
fr: 20 août 2000

source: Debhelper Commands
fr: Commandes Debhelper

source: dh_installdefoma - install a defoma related scripts
fr: dh_installdefoma - installe un script de configuration Defoma

source: B<dh_installdefoma> I<[debhelper options] [-n]>
fr: B<dh_installdefoma> I<[options debhelper] [-n]>

source: dh_installdefoma is a debhelper program that is responsible for installing files related to defoma (DEbian FOnt MAnager) into package build directories. dh_installdefoma can be used by defoma-aware packages and/or font packages using defoma.
fr: B<dh_installdefoma> est un programme debhelper responsable de l'installation des fichiers liés à defoma (DEbian FOnt MAnager, le gestionnaire de polices Debian) dans les répertoires de construction d'un paquet. B<dh_installdefoma> peut être utilisé par les paquets pouvant utiliser defoma et les paquets fournissant des polices pour defoma.

source: It also automatically generates the postinst and pre/postrm commands needed to register a package as a defoma-aware and/or font package using defoma. See B<dh_installdeb>(1) for an explanation of how this works.
fr: Il génère également les commandes postinst et pre/postrm nécessaire à l'enregistrement d'un paquet utilisant defoma et de paquet fournissant des polices pour defoma. Voyez B<dh_installdeb>(1) pour une explication sur son fonctionnement.

source: If a file named debian/package.defoma exists, then it is installed into usr/share/defoma/scripts/package.defoma in the package build directory and put an un/registration method in maintainer scripts with defoma-app. If a file named debian/package.defoma-hints exists, then it is installed in etc/defoma/hints/package.hints in the package build directory and put an un/registration method in maintainer scripts with defoma-font. So when you create a defoma font package, what you need to do is only to put its hints file in debian/package.defoma-hints and install font files written in the hints file in the appropriate locations. When you create a defoma-aware package, what you need to do is only to put its defoma-script file in debian/package.defoma. The script file is automatically installed in the package build directory.
fr: Si un fichier nommé debian/paquet.defoma existe, alors il l'installe dans le fichier usr/share/defoma/scripts/paquet.defoma du répertoire de construction du paquet et place les commandes defoma-app d'enregistrement (et de désenregistrement) dans les scripts de maintenance. Si un fichier nommé debian/paquet.defoma-hints existe, alors il l'installe dans le fichier etc/defoma/hints/paquet.hints du répertoire de construction du paquet et les commandes defoma-font d'enregistrement (et désenregistrement) sont placées dans les scripts de maintenance. Ainsi, lorsque vous créez un paquet de polices pour defoma, vous n'avez qu'à placer les indications dans le fichier debian/package.defoma-hints et installer les fichiers de polices spécifiés dans ce fichier d'indications aux bons endroits. Lorsque vous créez un paquet qui peut utiliser defoma, vous n'avez qu'à placer le script de configuration Defoma dans le fichier debian/paquet.defoma. Ce script est automatiquement installé dans le répertoire de construction du paquet.

source: B<debhelper options>
fr: B<options debhelper>

source: See B<debhelper>(1) for a list of options common to all debhelper commands.
fr: Voir B<debhelper>(1) pour la liste des options communes à toutes les commandes debhelper.

source: B<-n, --noscripts>
fr: B<-n>, B<--noscripts>

source: Do not modify postinst/postrm scripts.
fr: Ne modifie pas les scripts postinst et postrm.

source: ENVIRONMENT
fr: ENVIRONNEMENT

source: See B<debhelper>(1) for a list of environment variables that affect all debhelper commands.
fr: Voir B<debhelper>(1) pour la liste des variables d'environnement qui affectent les commandes debhelper.

source: Note that this command is not idempotent. "dh_clean -k" should be called between invocations of this command. Otherwise, it may cause multiple instances of the same text to be added to maintainer scripts.
fr: Notez que cette commande n'est pas idempotente. « dh_clean -k » doit être appelée entre les différentes invocations de cette commande. Sinon, les commandes peuvent être ajoutées plusieurs fois aux scripts de maintenance.

source: AUTHOR
fr: AUTEUR

source: defoma-psfont-installer - register fonts installed in a PostScript printer.
fr: defoma-psfont-installer - enregistre les polices installées sur une imprimante PostScript

source: B<defoma-psfont-installer> is a tool to register fonts installed in a PostScript printer to Defoma, Debian Font Manager. Those who want to print a PostScript file using the printer fonts may want to have all the printer fonts appear in a PostScript font selection menu of an application. B<defoma-psfont-installer> helps registering printer fonts. It can parse PPD -- PostScript Printer Description -- file and retrieve available printer font names from the file, then presumes the hints according to each of the font name, and creates a hintfile and register them. It is strongly recommended to prepare a PPD file.
fr: B<defoma-psfont-installer> permet de déclarer les polices installées sur une imprimante PostScript à Defoma, le gestionnaire de polices Debian. Les personnes qui veulent imprimer un fichier PostScript en utilisant les polices d'une imprimante voudront sûrement voir apparaître la liste de ces polices dans le menu de sélection des polices PostScript d'une application. B<defoma-psfont-installer> facilite l'enregistrement de ces polices. Il analyse le fichier PPD (« PostScript Printer Description ») et récupère les noms des polices disponibles sur l'imprimante ; il devine les indications (« hints ») d'après les noms de ces polices et crée un fichier pour les enregistrer. Il est fortement recommandé de préparer un fichier PPD.

source: Hintfile that B<defoma-psfont-installer> generates.
fr: Fichier d'indications que B<defoma-psfont-installer> génère.

source: November 27, 2001
fr: 27 novembre 2001

source: dfontmgr - GUI frontend for defoma
fr: dfontmgr - interface graphique pour defoma

source: B<dfontmgr> is a GUI frontend for defoma. You can see the fonts registered to defoma, their hints, their status (which applications they are succeeded or failed to be registered), the applications using defoma framework, information of the applications and the contents of their id-caches. You can also register a font by drag-and-drop'ing a font file, generating its hints as much as possible by asking you some questions, unregister a registered font, change hints of and re-register a registered font. If a defoma-aware application uses an id-cache and if there's an identifier conflict (which means some fonts provide the same identifier) in the id-cache, you can set which font to provide the identifier.
fr: B<dfontmgr> est une interface graphique pour defoma. Elle permet de visualiser les polices enregistrées auprès de defoma, leurs indications, leur état (les applications auprès desquelles elles ont pu ou n'ont pas pu être enregistrées), les applications utilisant defoma, des informations sur les applications et le contenu de leur base de données de référence (« id-cache »). Vous pouvez également enregistrer une police en glissant-déposant le fichier d'une police ; vous pouvez générer les indications avec les questions posées. Vous pouvez également retirer une police, changer les indications ou réenregistrer une police déjà enregistrée. Si une application supportant defoma, utilise une base de référence, et s'il y a un conflit dans les identifiants (ce qui signifie que plusieurs polices fournissent le même identifiant), vous pouvez indiquer quelle est la police qui fournit cet identifiant.

source: Overview
fr: Vue d'ensemble

source: There are two buttons Font and Application under the top menu which currently consists only of the File menu.
fr: Il y a deux boutons Font (Police) et Application sous la barre de menus, qui ne contient pour l'instant qu'un menu File (Fichier).

source: Font Information
fr: Informations sur les polices

source: There are three panes. The leftmost pane shows all font categories. When you choose one of the categories, the list of all fonts registered in the category is shown in the upper-right pane, and when you choose one of the fonts, its detailed information is shown in the lower-right pane.
fr: Il y a trois panneaux. Celui situé à gauche affiche toutes les catégories. Quand vous choisissez une de ces catégories, la liste de toutes les polices enregistrées pour cette catégorie est affichée dans le panneau situé en haut à droite, et lorsque vous choisissez une de ces polices, les informations détaillées sur les polices sont affichées dans le panneau situé en bas à droite.

source: Application Information
fr: Informations sur les applications

source: There are three panes. The leftmost pane shows all applications using defoma framework. When you choose one of the applications, its information is shown in the upper-right pane. If the application make uses of id-caches, the content is shown in the lower-right pane.
fr: Il y a trois panneaux. Le panneau de gauche contient toutes les applications qui utilisent defoma. Lorsque vous sélectionnez une de ces applications, les informations relatives à cette application sont affichées dans le panneau en haut à droite. Si une application utilise une base de référence (« id-cache »), son contenu est affiché dans le panneau en bas à droite.

source: Id Cache Pane
fr: Panneau des bases de référence
