Repository: debian-ports/defoma
Catalog: man/po4a/po/*.po
Languages: fr

source: There are some buttons to control id-cache, one menu to specify which id-cache is shown, and a column list to show the content of selected id-cache. There are three columns: Type, Identifier and Font. The Type column represents the type of the identifier (either of RealName, Alias, User-defined Alias or Substituted Id of the font) with its status (asterisk and plus means the Id is provided by the Font). When you select one of the Id/Font pair, its information is shown in the Application Information pane (upper-right pane). You can re-sort the list by clicking one of the column title: Type, Identifier or Font. When several fonts provide the same identifier, you can force the specific font to provide the identifier by selecting the id/font pair and clicking the Install button. You can also force the specific font not to provide the identifier by clicking the Exclude button. You can clean up this forced status by clicking the unset button.
fr: Il comprend des boutons pour contrôler la base de référence, un menu pour sélectionner quelle base doit être affichée, et une liste verticale avec le contenu de la base sélectionnée. Cette dernière liste contient trois colonnes : Type, Identifier (identifiant) et Font (police). La colonne Type représente le type des identifiants (qui sont soit RealName, des Alias, des Alias définis par l'utilisateur, ou des Substituted Id d'une police) avec son état (un astérisque « * » ou un plus « + » signifie que l'identifiant est fourni par la police). Lorsque vous sélectionnez une paire identifiant / application, les informations relatives sont affichées dans le panneau d'information sur l'application (en haut à droite, « Application Information »). Vous pouvez retrier la liste en cliquant sur un des titres Type, Identifier ou Font. Lorsque plusieurs polices fournissent le même identifiant, vous pouvez forcer une police particulière à fournir un identifiant en sélectionnant un couple identifiant / police et en cliquant sur le bouton « Install ». Vous pouvez également empêcher une police donnée de fournir un identifiant en cliquant sur le bouton « Exclude ». Vous pouvez enlever cet état forcé en cliquant sur le bouton « Unset ».
