Repository: debian-ports/defoma
Catalog: man/po4a/po/*.po
Languages: fr

source: March 4, 2001
fr: 4 mars 2001

source: NAME
fr: NOM

source: defoma - Debian Font Manager, a framework for automatic font configuration.
fr: defoma - gestionnaire de polices Debian, outil de configuration automatique des polices.

source: B<defoma-font> [I<options>] I<command args..>
fr: B<defoma-font> [I<options>] I<commande paramètres>

source: B<defoma-app> [I<options>] I<command args..>
fr: B<defoma-app> [I<options>] I<commande paramètres>

source: B<defoma-subst> [I<options>] I<command args..>
fr: B<defoma-subst> [I<options>] I<commande paramètres>

source: Defoma stands for Debian Font Manager. It provides a framework for automatic font configuration. This manpage introduces general Defoma concepts, please refer the manpage of defoma-font, defoma-app, or defoma-subst for the detailed information of each command.
fr: Defoma signifie « Debian Font Manager ». C'est l'outil de configuration des polices Debian. Reportez-vous aux pages de manuel de defoma-font, defoma-app ou defoma-subst pour plus d'informations sur chaque commande. Cette page est une introduction à Defoma.

source: Fonts are used by numerous applications, but generally need to be configured separately for each application. Defoma solves this problem by calling configuration scripts to update the font configuration of applications whenever a font is installed or removed.
fr: Bien que les polices soient en général partagées par plusieurs applications, il n'y a pas d'outil permettant de configurer les polices pour toutes les applications, par exemple, pour les applications de haut niveau comme les traitements de texte et les programmes de dessin vectoriel. Defoma propose une solution à ce problème. Quand une police est installée ou retirée, Defoma met à jour la configuration des polices pour chaque application via un script propre à chaque application.

source: A B<Defoma-configuration script> is a perl library that each application should install as
fr: Le B<script de configuration Defoma> est un script Perl que l'application doit installer dans un fichier nommé

source: I<application-name>.defoma under /usr/share/defoma/scripts
fr: I<nom-application>.defoma dans /usr/share/defoma/scripts,

source: and which configures a font for that application. The following is an example of a script named
fr: et qui prend en charge la configuration d'une police pour une application. Voici un exemple de script,

source: foo.defoma.
fr: toto.defoma.

source: package foo;
fr: package toto;

source: This example represents an application I<foo> that wants to configure I<truetype> and I<type1> category fonts. A function by the same name as the relevant category is called by Defoma with a command as the first argument, and then additional arguments depending on the command. The following is a list of commands.
fr: Cet exemple est un script qui configure les polices I<truetype> et I<type1> de l'application I<toto>. Les fonctions portent le nom du type de police, elles sont appelées par Defoma qui leur passe une commande et des paramètres. Voici la liste des commandes :

source: I<do-install-*> and I<do-remove-*> commands are only called from B<Id cache.> I<init> and I<term> are called at the start and end (respectively) of the entire process.
fr: Les commandes I<do-install-*> et I<do-remove-*> sont appelées par la B<base de référence> (« id cache ») et ne sont pas utilisées en pratique, à moins que le script n'y fasse explicitement appel. I<init> et I<term> sont appelées, respectivement, avant le début de l'inscription et après la fin de la désinscription.

source: B<Id cache> is another feature of Defoma. A common problem during automatic configuration is name space conflicts. Usually applications access fonts through logical font names (like XLFDs and PostScript font names) rather than the fonts themselves (as font filenames). Logical font names, called identifiers in Defoma, can easily conflict especially when font aliases are permitted. Through the Id cache mechanism, only one font is actually installed for each identifier even if it is provided by several fonts.
fr: La B<base de référence> est une autre caractéristique de Defoma. La configuration automatique soulève le problème des conflits de noms. D'habitude, les applications appellent les polices par leur nom logique (e.g. les noms de polices XLFD et PostScript) plutôt que par leur nom propre (e.g. le nom du fichier de police). Les noms logiques, appelés identifiants par Defoma, peuvent rapidement entrer en conflit, surtout si l'utilisation des alias est autorisée. Le fonctionnement de la base de référence permet de faire correspondre à un identifiant une seule police installée, même si plusieurs polices ont le même identifiant.

source: B<Id Substitution> is an additional feature of B<Id cache>. It selects a font to provide an id specified by a rulefile. The rulefile describes rules giving required ids and their hints. A rule is used to have more similar-looking fonts with the same characters substitute for a required id. This feature can also be used for the purpose of grouping fonts into different categories.
fr: La B<substitution d'identifiant> est une caractéristique supplémentaire de la B<base de référence>. Elle permet à une police donnée de fournir un identifiant donné spécifié dans un fichier de règles. Un fichier de règles décrit les règles, c'est-à-dire les identifiants devant être substitués (autrement dit, requis) et les indications qui leur sont associées. Les règles permettent, dans le cas d'un identifiant requis, d'avoir des polices plus ressemblantes avec la même substitution, pour un identifiant requis. Cette fonctionnalité peut également être utilisée pour créer des correspondances entre polices de différentes catégories.

source: A B<category> represents a type of font. Generally fonts that belong to the same category are configured the same way.
fr: Une B<catégorie> (« category ») est le type d'une police. La configuration de polices de même type est souvent similaire, on peut donc regrouper les configurations semblables dans le script.

source: B<Hints> represent essential font information and typeface information about the font. They consist of some HintTypes and their values. They can be specified from the command line options of defoma-font, or through a B<hintfile>.
fr: Les B<indications> (« hints ») regroupent les caractéristiques principales de la police, représentées par une liste de types d'indication avec leur valeur associée. Elles peuvent être spécifiées sur la ligne de commande de defoma-font ou dans un B<fichier d'indications> (« hintfile »).

source: B<Hintfile> describes one or more fonts and their hints in a single file. It is supposed to be put under
fr: Le B<fichier d'indications> est un fichier contenant plusieurs indications, pour une ou plusieurs polices. Comme il est placé en tant que fichier de configuration dans

source: as a conffile, so that users can modify the hints.
fr: les utilisateurs peuvent modifier eux-mêmes les indications.

source: Below is an example hintfile. B<defoma-hints> is a tool to help generating hints as well as the hintfile, so you do not have to create one from scratch.
fr: B<defoma-hints> est l'outil qui fabrique les fichiers d'indications, vous n'avez donc pas à écrire ces fichiers à la main. Voici un exemple de fichier d'indications :

source: category type1 begin /usr/share/fonts/type1/foo.pfa FontName = Helvetica Charset = ISO8859-1 Family = Helvetica Weight = Medium Shape = Upright NoSerif GeneralFamily = SansSerif X-FontName = -urw-helvetica-medium-r-noraml--0-0-0-0-p-iso8859-1 end begin /usr/share/fonts/type1/foob.pfa FontName = Helvetica-Bold Charset = ISO8859-1 Family = Helvetica Weight = Bold Shape = Upright NoSerif GeneralFamily = SansSerif X-FontName = -urw-helvetica-bold-r-noraml--0-0-0-0-p-iso8859-1 end
fr: category type1 begin /usr/share/fonts/type1/toto1.pfa FontName = Helvetica Charset = ISO8859-1 Family = Helvetica Weight = Medium Shape = Upright NoSerif GeneralFamily = SansSerif X-FontName = -urw-helvetica-medium-r-noraml--0-0-0-0-p-iso8859-1 end begin /usr/share/fonts/type1/toto2.pfa FontName = Helvetica-Bold Charset = ISO8859-1 Family = Helvetica Weight = Bold Shape = Upright NoSerif GeneralFamily = SansSerif X-FontName = -urw-helvetica-bold-r-noraml--0-0-0-0-p-iso8859-1 end

source: SEE ALSO
fr: VOIR AUSSI

source: defoma-app - configure a specific application about fonts registered in Debian Font Manager.
fr: defoma-app - configure une application avec les polices enregistrées auprès du gestionnaire de polices Debian.

source: B<defoma-app> [I<options>] B<clean> I<application [category..]>
fr: B<defoma-app> [I<options>] B<clean> I<application> [I<catégorie>...]

source: B<defoma-app> [I<options>] B<update> I<application [category..]>
fr: B<defoma-app> [I<options>] B<update> I<application> [I<catégorie>...]

source: B<defoma-app> [I<options>] B<ignore> I<application [category..]>
fr: B<defoma-app> [I<options>] B<ignore> I<application> [I<catégorie>...]

source: B<defoma-app> is a tool to configure the fonts registered in Defoma, Debian Font Manager, for a specific application. Defoma calls the Defoma-configuration script of the specified application with register or unregister command for each of the fonts registered in the categories accepted by the application. It is supposed to be invoked from postinst/prerm scripts of application packages, but may be invoked from console.
fr: B<defoma-app> permet de configurer les polices enregistrées auprès de Defoma, le gestionnaire de polices Debian, pour une application. Defoma appelle le script de configuration Defoma de cette application avec la commande « register » ou « unregister » pour chacune des polices enregistrées dans les catégories supportées par l'application. Cet outil est censé être appelé par les scripts « postinst » ou « prerm » des paquets des applications, mais peut aussi être appelé depuis une console.

source: I<application> specifies the name of the application that is going to be configured. The specified application must have
fr: I<application> est le nom de l'application qui va être configurée. Cette application doit fournir un script Perl

source: I<application-name>.defoma
fr: I<application>.defoma

source: perl script under
fr: placé dans

source: If I<category> is specified, only the fonts in the specified categories get processed. Otherwise all the fonts in all the categories accepted by the application get processed.
fr: Si une (ou plusieurs) I<catégorie> est spécifiée, alors seules les polices de cette catégorie sont traitées. Sinon, toutes les polices de toutes les catégories acceptées par l'application sont prises en compte.

source: COMMANDS
fr: COMMANDES

source: Update the configuration of the specified I<application> about the fonts registered in the specified I<category>. I<category> can be omitted. When it is specified and the specified category is set B<ignored> (to be mentioned later), B<ignore> flag gets unset so the category gets updated. Internally the Defoma-configuration script of the application gets called with B<unregister> command first and then with B<register> command for each font of the category. Some directories and symlinks specified in the header of the script might be generated automatically.
fr: Met à jour la configuration de l'I<application> concernant les polices de la I<catégorie> spécifiée. La I<catégorie> peut être omise. Lorsqu'elle est spécifiée et qu'elle est marquée comme devant être ignorée (il en sera fait mention plus tard), le drapeau B<ignore> est enlevé de telle sorte que la catégorie soit mise à jour. En interne, les scripts de configuration Defoma de l'application sont dans un premier temps appelés avec la commande B<unregister>, puis avec la commande B<register> pour chacune des polices de la catégorie. Certains répertoires et liens symboliques spécifiés dans l'en-tête du script pourront être générés automatiquement.

source: This command should be invoked when the Defoma-configuration script is newly installed or updated so that the script gets installed to Defoma data directory and the fonts get configured to the application. It means it is supposed to be invoked on the postinst configure phase.
fr: Cette commande doit être invoquée lorsqu'un script de configuration Defoma est installé ou mis à jour ; ainsi le script est installé dans le répertoire de données de Defoma et les polices sont configurées pour l'application. Ce qui suppose que la commande est invoquée pendant la phase de configuration « postinst ».

source: Clean up the configuration of the specified I<application> about the fonts registered in the specified I<category>. I<category> can be omitted. Internally the Defoma-configuration script of the application gets called with B<unregister> command for each font of the category.
fr: Enlève la configuration de l'I<application> spécifiée concernant les polices enregistrées dans la I<catégorie> spécifiée. La I<catégorie> peut être omise. En interne, le script de configuration Defoma de l'application est appelé avec la commande B<unregister> pour chacune des polices de la I<catégorie>.

source: This command is almost the same as B<clean> command. It only differs on removing the script installed in the defoma data directory and some directories and symlinks if any was generated in the update command before.
fr: Cette commande est presque identique à la commande B<clean>. Elle ne diffère que par le fait qu'elle retire le script installé dans le répertoire de données de Defoma, ainsi que les répertoires ou liens symboliques qui ont été générés précédemment par une commande B<update>.

source: This command should be invoked when the Defoma-configuration script is going to be removed so that the script gets removed and the font configuration gets cleaned. It means it is supposed to be invoked on the prerm remove phase.
fr: Cette commande doit être invoquée pour retirer le script de configuration Defoma et nettoyer la configuration des polices. Cette commande est censée être appelée dans la phase de « prerm » d'un paquet.

source: This command makes the specified I<application> not use the fonts registered in the specified I<category>. It removes the fonts in the category out of the font configuration and sets the `ignore' flag against the category in order to make the Defoma-configuration script of the application not accept fonts in the category. If I<category> is omitted, all categories gets ignored. To unset the `ignore' flag, run defoma-app with B<update> command and the category against which you want to unset the flag.
fr: Cette commande indique que l'I<application> n'utilisera pas les polices de la I<catégorie> spécifiée. Elle retire les polices de la I<catégorie> de la configuration des polices et place le drapeau « ignore » sur cette catégorie pour que le script de configuration Defoma de cette application n'accepte pas les polices de cette I<catégorie>. Si la I<catégorie> est omise, toutes les catégories sont ignorées. Pour retirer ce drapeau « ignore », veuillez exécuter B<defoma-app> avec la commande B<update> et la catégorie pour laquelle vous voulez retirer le drapeau.

source: Exit with true value (0) even if error occurs.
fr: Quitte avec une valeur nulle, même en cas d'erreur.

source: Verbose output.
fr: Sortie bavarde.

source: Debug/Testing mode.
fr: Mode débogage.

source: Quiet output.
fr: Sortie silencieuse.

source: Defoma::Common - Defoma module providing miscellaneous functions.
fr: Defoma::Common - module Defoma fournissant diverses fonctions.

source: $h = parse_hints_start( I<hints...> );
fr: $h = parse_hints_start( I<indications...> );

source: $hsub = parse_hints_subhints( I<hints_hash>, I<face> );
fr: $hsub = parse_hints_subhints( I<table_hachage_indications>, I<police> );

source: $hsub = parse_hints_subhints_inherit( I<hints_hash>, I<face> );
fr: $hsub = parse_hints_subhints_inherit( I<table_hachage_indications>, I<police> );

source: parse_hints_cut( I<hints_hash>, I<hinttypes...> );
fr: parse_hints_cut( I<table_hachage_indications>, I<types_indications...> );

source: parse_hints_cut_except( I<hints_hash>, I<hinttypes...> );
fr: parse_hints_cut_except( I<table_hachage_indications>, I<types_indications...> );

source: @hints = parse_hints_build( I<hints_hash> );
fr: @hints = parse_hints_build( I<table_hachage_indications> );

source: @XLFDs = get_xlfd_of_font( I<font>, level =E<gt> I<level>, face =E<gt> I<face> );
fr: @XLFDs = get_xlfd_of_font( I<police>, level =E<gt> I<niveau>, face =E<gt> I<police> );

source: my $num = weight_ascii2integer( I<weightstring> );
fr: my $num = weight_ascii2integer( I<chaîne_graisse> );

source: my $num = weight_a2i( I<weightstring> );
fr: my $num = weight_a2i( I<chaîne_graisse> );

source: B<parse_hints_start> is a function to convert hints in an array to a hash. Hints consist of a list of hinttype and its value(s). Following is the example of hints in an array form.
fr: B<parse_hints_start> est une fonction qui permet de convertir des indications contenues dans un tableau vers une table de hachage. Une indication consiste en un type et une ou plusieurs valeurs. Voici des exemples d'indication sous la forme d'un tableau.

source: In this example, FontName, Family, GeneralFamily, Weight, Shape and Charset are hinttypes. Items starting with double minus characters \&'--' are taken as hinttype. The others are taken as values. The function converts this array to a hash described in the following style.
fr: Dans cet exemple, FontName, Family, GeneralFamily, Weight, Shape et Charset sont les types des indications. Les éléments commençant par deux tirets « -- » sont considérés comme des types d'indication. Les autres sont considérés comme les valeurs. La fonction convertit ce tableau en une table de hachage décrite de la façon suivante :

source: You see that hinttypes are used as keys of a hash, and that Shape has two values, NoSerif and Italic. If a certain hinttype has more than one values, they are combined into a single string separated by space.
fr: Vous voyez que les types d'indication sont utilisés comme clés de hachage, et que la forme (Shape) a plus d'une valeur : NoSerif et Italic. Si un type d'indication a plus d'une valeur, alors elles sont combinées en une unique chaîne, séparées par une espace.

source: B<parse_hints_subhints> is a function to get a sub hint hash pointed by I<face> from the hint hash specified by I<hints_hash>. Please look at following example of a hint hash.
fr: B<parse_hints_subhints> est une fonction qui permet d'obtenir la clé de hachage d'une indication secondaire pointée par I<police> dans la table de hachage I<table_hachage_indications>. Voici un exemple de table de hachage d'indications :

source: You see there're some numbered hinttypes. B<parse_hints_subhints> extracts the hints of the specific number from it. For example, you can extract the non-numbered hints FontName and Charset by:
fr: Vous voyez dans cet exemple que certains types d'indication sont numérotés. B<parse_hints_subhints> extrait l'indication ayant le bon numéro. Par exemple, vous pouvez extraire les indications FontName et Charset non numérotées avec :

source: and the content of $hsub will be:
fr: et le contenu de $hsub sera :

source: If you set 1 to the second argument of B<parse_hints_subhints>, the content of $hsub will be:
fr: Si vous mettez à 1 le deuxième paramètre de B<parse_hints_subhints>, alors le contenu de $hsub sera :

source: Note that the number of each hinttype is removed.
fr: Notez que le numéro de chaque type d'indication est retiré.

source: B<parse_hints_subhints_inherit> is almost the same as B<parse_hints_subhints>, only differs it inherits non-numbered hints specified by Inherit hinttype. Following is the result of B<parse_hints_subhints_inherit> with 1 and 2 set to the second argument in the example of B<parse_hints_subhints>.
fr: B<parse_hints_subhints_inherit> est presque identique à B<parse_hints_subhints>, à la différence que les indications des types spécifiés dans l'indication de type « Inherit » sont héritées. Voici les résultats de B<parse_hints_subhints_inherit> avec les valeurs 1 et 2 comme second paramètre dans l'exemple donné avec B<parse_hints_subhints>.

source: B<parse_hints_cut> is a function to remove hinttypes specified by I<hinttypes> and their values from the hint hash. It is supposed to be used together with B<parse_hints_build> function.
fr: B<parse_hints_cut> permet de retirer d'une table de hachage d'indications les types d'indication (et leur valeur) spécifiés par I<types_indications>. Cette fonction est supposée être utilisée conjointement avec B<parse_hints_build>.

source: B<parse_hints_cut_except> is a function to remove all hinttypes except those specified by I<hinttypes> and their values from the hint hash. It is supposed to be used together with B<parse_hints_build> function.
fr: B<parse_hints_cut_except> permet de retirer d'une table de hachage d'indications tous les types d'indication (et leur valeur), sauf ceux spécifiés par I<types_indications>. Cette fonction est supposée être utilisée conjointement avec B<parse_hints_build>.

source: B<parse_hints_build> is a function to convert hints in a hash to an array.
fr: B<parse_hints_build> permet de convertir une table de hachage d'indications en un tableau.

source: B<get_charset> is a function to convert X-RegistryEncoding specified by I<xencoding> into Charset. X-RegistryEncoding is the last two elements of XLFD, like iso8859-1 and jisx0208.1983-0. The returned values of these two are ISO8859-1 and JISX0208 respectively.
fr: B<get_charset> est une fonction qui permet de convertir un champ X-RegistryEncoding spécifié par I<xencoding> en un Charset. X-RegistryEncoding correspond aux deux derniers éléments d'un XLFD [ NdT : X Logical Font Description, une chaîne de 15 champs séparés par des tirets qui permet de décrire une police ], comme iso8859-1 ou jisx0208.1983-0. Les valeurs de retour pour ces exemples sont respectivement ISO8859-1 et JISX0208.

source: B<get_xencoding> is a function to convert Charset and Encoding specified by I<charset> and I<encoding> into X-RegistryEncoding. I<encoding> is often omitted.
fr: B<get_xencoding> permet de convertir un jeu de caractères (« Charset ») et un codage (« Encoding ») spécifiés par I<charset> et I<encoding> en un X-RegistryEncoding. I<encoding> est en règle générale omis.

source: B<weight_ascii2integer> is a function to convert Weight in string (like Bold and Medium) into a numeric value (integer). Medium is always zero, and the bolder, the larger, the lighter, the smaller. For example, Bold is +2, and Light is -2. B<weight_a2i> is abbreviation for B<weight_ascii2integer>.
fr: B<weight_ascii2integer> est une fonction qui permet de convertir une graisse de police (Weight) sous forme de chaîne - comme Bold (gras) ou Medium (moyen) - en une valeur numérique (un entier). Medium a toujours la valeur 0, et plus la police est grasse, plus ce nombre est élevé. Par exemple, Bold vaut +2, et Light (léger) vaut -2. B<weight_a2i> est un raccourci pour B<weight_ascii2integer>.
