Repository: debian-ports/defoma
Catalog: man/po4a/po/*.po
Languages: fr

source: I<Substituted> is yet another name of a font, but unlike Alias, it is not taken from the hints of the font, nor directly registered to an id-cache by Defoma-configuration scripts. It is rather taken from a subst-rule, which is handled by Defoma::Subst module, and is registered by the module. If you want a certain font to substitute for another id, you should register the font (and its RealName) to a subst-cache. For more detail, please refer the Defoma::Subst manpage.
fr: I<Substituted> est encore un autre nom d'une police, qui contrairement à Alias n'est ni pris dans les indications de la police, ni directement enregistré dans une base de référence par les scripts de configuration Defoma. Il est plutôt pris dans une règle de substitution (subst-rule), qui est gérée par le module Defoma::Subst, et est enregistrée par le module. Si vous voulez qu'une police particulière se substitue à un autre identifiant, vous devez enregistrer la police (et son nom réel) auprès d'un cache de substitution (subst-cache). Pour plus de détails, veuillez consulter la page de manuel Defoma::Subst.

source: DETAIL OF HOW DEFOMA::ID WORKS
fr: DÉTAIL SUR LE FONCTIONNEMENT DE DEFOMA::ID

source: Registration and Unregistration of ids of a font are usually performed on Defoma-configuration scripts at register and unregister commands respectively, and actual installation and removal for a certain id of a font must not be performed at register and unregister commands, but at
fr: L'enregistrement et le désenregistrement des identifiants d'une police sont généralement effectués par les scripts de configuration Defoma avec les commandes B<register> et B<unregister> respectivement, mais l'installation et le retrait de certains identifiants ne doivent pas être effectués lors de l'appel aux commandes B<register> et B<unregister>, mais lors de l'appel aux commandes

source: I<do-install-(real,alias,subst)> and I<do-remove-(real,alias,subst)>
fr: I<do-install-(real,alias,subst)> et I<do-remove-(real,alias,subst)>

source: commands respectively. Following explains how an id of a font is registered/unregistered to/from an id-cache.
fr: respectivement. Les exemples suivants montrent comment les identifiants des polices sont enregistrés dans une base de référence et comment il en sont retirés.

source: 1.Registeration
fr: 1.Enregistrement

source: Defoma::Id module records the id, font, type, priority and some other informations in the id-cache.
fr: Le module Defoma::Id enregistre l'identifiant, la police, le type, la priorité et encore d'autres informations dans une base de référence.

source: the module seeks fonts which provides the id from the id-cache, and gets the most prior font of them. RealName is always more prior to Alias, and Alias is always more prior to Substituted.
fr: Le module recherche les polices qui fournissent l'identifiant de la base de référence, et prend la première d'entre elles. Les noms réels (RealName) sont toujours prioritaires par rapport aux Alias, et les Alias par rapport aux noms substitués (Substituted).

source: If no font is actually installed for the id, the module calls back the script with do-install-E<lt>typeE<gt> command. If the script succeeds installation of the font for the id, the module records the id and the font as INSTALLED.
fr: Si aucune police n'est installée pour cet identifiant, le module rappelle le script avec la commande do-install-E<lt>typeE<gt>. Si le script réussit l'installation de la police pour l'identifiant, le module marque l'identifiant et la police comme INSTALLED (installé).

source: If another font is already INSTALLED for the id, the module calls back the script with do-remove-E<lt>typeE<gt> command to remove the old most-prior font for the id, and removes the INSTALLED entry. Then the module calls back again the script with do-install-E<lt>typeE<gt> command to install the new most-prior font for the id. If the script succeeds installation of the font for the id, the module records the id and the font as INSTALLED.
fr: Si une autre police est déjà marquée INSTALLED (installée) pour l'identifiant, le module rappelle le script avec la commande do-remove-E<lt>typeE<gt> pour retirer l'ancienne police prioritaire pour cette identifiant, et retire la marque INSTALLED. Ensuite, le module rappelle le script avec la commande do-install-E<lt>typeE<gt> pour installer la police comme prioritaire pour cet identifiant. En cas de succès de l'installation de la police pour l'identifiant, le module marque l'identifiant et la police comme étant INSTALLED.

source: 2.Unregistration
fr: 2.Désenregistrement

source: If the font is installed for the id, Defoma::Id module calls back the script with do-remove-E<lt>typeE<gt> command to remove the font for the id, and removes the INSTALLED entry. Then the module seeks fonts which provides the id from the id-cache. If the id is provided by other fonts, the module seeks the most-prior font from them, and installs it as mentioned above section 1.3.
fr: Si la police est installée pour l'identifiant, le module Defoma::Id rappelle le script avec la commande do-remove-E<lt>typeE<gt> afin de retirer la police pour cet identifiant, et retire la marque INSTALLED. Ensuite, le module recherche les polices qui fournissent l'identifiant dans la base de référence. Si l'identifiant est fourni par d'autres polices, le module recherche la plus prioritaire d'entre elles, et l'installe comme mentionné dans la section 1.3 précédente.

source: The module removes the entry recording the id and the font.
fr: Le module retire l'entrée correspondant à l'identifiant et la police.

source: These processes make only one, more appropriate font provide an certain id, so the name-space conflict would be avoided.
fr: Ces processus permettent de n'avoir qu'une seule police, la plus appropriée, qui fournit un identifiant donné, de telle sorte qu'il n'y ait pas de conflit de nom.

source: FORMAT OF ID CACHE
fr: FORMAT D'UNE BASE DE RÉFÉRENCE

source: id-cache holds eight items for each entry: id, font, type, priority, category, depid, depfont and hints.
fr: Une base de référence contient huit champs pour chaque entrée : id (identifiant), font (police), type, priority (priorité), category (catégorie), depid, depfont et hints (indications).

source: B<type> represents the type of the entry in a combination of some letters. id-cache handles font entry and mark entry. The latter is used to have a certain less prior font installed for a certain id (i.e. marked as USE), or to keep a certain font from being installed for a certain id (i.e. marked as EXCLUDE), and is supposed to be set by users and not to be referred from Defoma-configuration scripts, just for internal use. On the other hand, font entry holds information of a certain id of a font and may be referred from the scripts.
fr: Le B<type> représente le type d'une entrée à l'aide d'une combinaison de lettres. Une base de référence gère des entrées de polices et de marques. Ce dernier type d'entrée permet d'installer des polices moins prioritaires pour certains identifiants (qui sont marqués USE - utilisé), ou pour conserver une police installée pour un certain identifiant (marqué comme EXCLUDE - exclu). Elles sont supposées être placées par les utilisateurs, et ne doivent pas être utilisées dans les scripts de configuration Defoma, juste pour une utilisation interne. Les entrées de polices contiennent des informations sur certains identifiants d'une police et peuvent être utilisées dans les scripts.

source: B<type> consists of two or three letters. The first letter represents the type of the entry and is either B<S >orB< M > (font entry or mark entry, respectively). If the first letter is B<S>, which means it is font entry, the second letter represents the type of the font and is either B<r>,B< a>,B< S > (real, alias or subst respectively). If the first letter is B<M>, which means it is mark entry, the second letter represents the type of the mark and either of B< u >orB< x > (use or exclude respectively). If the entry is font entry, which means the first letter is B<S>, and the font and the id of the entry is INSTALLED, there's a third letter and it is B<I>.
fr: Le B<type> consiste en deux ou trois lettres. La première lettre représente le type d'entrée, qui est soit B<S> (pour les polices), soit B<M> (pour les marques). Si la première lettre est un B<S>, ce qui signifie qu'il s'agit de l'entrée d'une police, la deuxième lettre peut être un B<r> (nom réel), un B<a> (un alias) ou un B<S> (pour une police de substitution). Si la première lettre est un B<M>, ce qui signifie qu'il s'agit de l'entrée d'une marque, la seconde lettre est soit un B<u> (USE) soit un B<x> (EXCLUDE). Pour les entrées de polices (dont la première lettre est un B<S>), si la police et l'identifiant de l'entrée sont marqués INSTALLED, il y a une troisième lettre, qui est B<I>.

source: B<depid> and B<depfont> represent dependency of the id of the font. The font never gets installed unless the B<depfont> is installed for the B<depid>. I<origin> and I<depend> arguments of B<defoma_id_register> affect these items. If the id of the font doesn't depend on any other id and/or font, these items are set to '.'.
fr: B<depid> et B<depfont> représentent les dépendances envers un identifiant ou une police. Une police n'est jamais installée, à moins que la police B<depfont> soit installée pour l'identifiant B<depid>. Les paramètres I<origine> et I<depend> de B<defoma_id_register> affectent ces champs. Si l'identifiant d'une police ne dépend d'aucun autre identifiant ou police, alors ces champs valent « . ».

source: B<hints> represents the hints of the id of the font. It is specified by I<hints> argument of B<defoma_id_register>. You must use B<defoma_id_get_hints> to access the value of this item.
fr: Le champ B<hints> (indications) représente les indications d'un identifiant. Il est spécifié par l'argument I<indications> de B<defoma_id_register>. Vous devez utiliser B<defoma_id_get_hints> pour accéder à la valeur de ce champ.

source: An item of each entry of an id-cache are accessible as an element of id-object whose key is e_id, e_font, e_type, e_priority, e_category, e_depid, e_depfont. For example,
fr: Les champs de chaque entrée d'une base de référence sont accessibles par les champs de l'I<id-object> dont les clefs sont e_id, e_font, e_type, e_priority, e_category, e_depid, et e_depfont. Par exemple :

source: accesses the font of entry #3 of id-object $Id.
fr: permet d'accéder à la police de la troisième entrée de l'id-object $ID.

source: Here's an example of an id-cache.
fr: Voici un exemple de base de référence :

source: It show a.pfa has two identifiers: Helvetica for RealName and Courier for Alias, and b.ttf has two identifiers: Times-Roman for RealName and Courier For Alias.
fr: Cette base montre que a.pfa a deux identifiants : Helvetica comme RealName et Courier comme Alias. b.ttf a également deux identifiants : Times-Roman comme RealName et Courier comme Alias.

source: Two fonts have the same identifier Courier, but this id-cache makes Courier point to b.ttf (in other words, lets b.ttf provide Courier).
fr: Deux polices ont le même identifiant Courier, mais cette base de référence fait pointer Courier vers b.ttf (autrement dit, c'est b.ttf qui fournit Courier).

source: FUNCTIONS
fr: FONCTIONS

source: B<defoma_id_open_cache> is a function used to open an id-cache. id-caches are independent between applications so usually a Defoma-configuration script of a certain application cannot open an id-cache of another application. Each application can have more than one id-caches, and each of them are distinguished by its I<suffix> unique to the application. You can omit the I<suffix> argument if the application uses only one id-cache. I<package_name> should be omitted for most cases. It returns I<id_object> which is used as a descriptor for further handling of the id-cache.
fr: B<defoma_id_open_cache> permet d'ouvrir une base de référence. Les bases de référence dépendent des applications. Les scripts de configuration Defoma d'une application ne peuvent pas ouvrir les bases de référence d'une autre application. Chaque application peut avoir plusieurs bases de référence, qui sont identifiées par un I<suffixe> unique pour une application. Vous pouvez omettre le I<suffixe> pour une application n'utilisant qu'une seule base de référence. I<nom_paquet> doit être omis dans la plupart des cas. La fonction retourne un objet I<id_object> utilisé comme descripteur pour les opérations suivantes.

source: B<defoma_id_close_cache> is a function used to close an id-cache. Internally it writes the content of an id-cache to the file which is identified by I<id_object>.
fr: B<defoma_id_close_cache> permet de fermer une base de référence. En interne, cela permet d'écrire le contenu d'une base de référence dans un fichier identifié par I<id_object>.

source: B<defoma_id_register> is a function used to register a font and one of its ids to an id-cache identified by I<id_object>. You must at least pass I< type>,I< font>,I< id >andI< priority> as its arguments. I<type> is either of 'real', 'alias' or 'subst', which corresponds to RealName, Alias or Substituted mentioned above, respectively. 'subst' should be specified only by Defoma::Subst module, so 'real' and 'alias' are possible choices. If 'alias' is specified as the type of a font, you must specify the RealName of the font by I<origin>. Specifying the I<origin> is required for non-RealName ids because they should not be installed unless the RealName of the font is installed. If 'real' is specified as the type, you can specify the hints of the font by I<hints>.
fr: B<defoma_id_register> permet d'enregistrer une police et un de ses identifiants dans la base de référence I<id_object>. Vous devez au moins fournir les paramètres I<type>, I<font>, I<id> et I<priority>. I<type> peut prendre les valeurs « real », « alias » ou « subst » qui correspondent à des noms réels (RealName), des Alias, ou des polices de substitution (Substituted), comme mentionné précédemment. « subst » ne devrait être utilisé que par le module Defoma::Subst, ce qui ne laisse donc que le choix « real » et « alias ». Si « alias » est utilisé comme type de police, alors vous devez spécifier le nom réel de la police dans le paramètre I<origine>. Il est obligatoire de spécifier l'I<origine> pour les identifiants ne correspondant pas à un nom réel, parce que ces identifiants ne doivent pas être installés, à moins que le nom réel de la police le soit. Si « real » est utilisé comme type, alors vous devez spécifier les I<indications> de la police.

source: B<defoma_id_unregister> is a function used to unregister one or all registered id(s) of a certain font from and id-cache. If I<id> is specified, only the id of the specified I<font> is unregistered from the id-cache specified by I<id_object>. Otherwise, all ids of the font are unregistered.
fr: B<defoma_id_unregister> permet de retirer un identifiant (ou tous) d'une police d'une base de référence. Si I<id> est spécifié, seul cet identifiant de la I<police> spécifiée est retiré de la base de référence I<id_object>. Sinon, tous les identifiants de la police sont retirés.

source: B<defoma_id_grep_cache> is a function that searches the id-cache specified by I<id_object> for the specified id/font/category/depid/depfont, and returns a list of indexes. I<search-type> is either of real, alias, subst, font, installed or mark, which narrows down the subjects of searching. I<id >,I<font >,I<type >,I<category >,I<depid >andI< depfont > decides the subjects of searching more specifically. Not all of these, nor none of these are required.
fr: B<defoma_id_grep_cache> permet de rechercher dans la base de référence I<id_object> un certain identifiant, police, catégorie, depid ou depfont et de retourner la liste des index. Le paramètre I<search-type> peut être « real », « alias », « subst », « font », « installed » ou « mark » pour limiter les sujets de la recherche. Les paramètres I<id>, I<font>, I<type>, I<category>, I<depid> et I<depfont> permettent de préciser des valeurs de recherche pour ces différents champs. Il n'est pas nécessaire de préciser aucun de ces paramètres.

source: B<defoma_id_get_hints> is a function that returns hints of the I<index> of the id-cache specified by I<id_object .> If the index of Alias or Substituted is specified, it returns the hints of its RealName that is specified in the I<origin> argument of B<defoma_id_register> when the Alias/Substituted identifier was registered.
fr: B<defoma_id_get_hints> permet d'obtenir les indications de l'index spécifié dans la base de référence I<id_object>. Si l'index d'un Alias ou d'une police de substitution (Substituted) est spécifié, cette fonction retourne les indications de la police dont le nom réel (RealName) est spécifié par le paramètre I<origine> de B<defoma_id_register> lorsque cet alias ou cette police de substitution a été enregistré.

source: B<defoma_id_set> is a function used to make the specified I<font> provide the specified I<id>, or to prevent the specified I<font> from providing the specifid I<id>. B<install> or B<exclude> may be given to the I<flag>. B<defoma_id_unset> is a function used to unset the set flag of the specified I<id>andI<font>.
fr: B<defoma_id_set> permet de faire fournir un I<id> à une I<police>, ou d'empêcher une I<police> de fournir un I<identifiant>. Le paramètre I<flag> peut valoir I<install> ou I<exclude>. B<defoma_id_unset> permet de supprimer le drapeau de l'I<identifiant> et de la I<police> spécifiés.

source: # Open an id-cache with 'test' as its suffix. $Id = defoma_id_open_cache('test');
fr: # Ouvre une base de référence avec « test » comme suffixe. $Id = defoma_id_open_cache('test');

source: # register ids in register command. my $font = shift; my $h = parse_hints_start('Alias', @_); my $fontname = $h-E<gt>{FontName}; my @alias = split(/ /, $h-E<gt>{Alias}); my $pri = $h-E<gt>{Priority};
fr: # enregistrement des identifiants avec la commande register. my $police = shift; my $h = parse_hints_start('Alias', @_); my $nom_police = $h-E<gt>{FontName}; my @alias = split(/ /, $h-E<gt>{Alias}); my $pri = $h-E<gt>{Priority};

source: defoma_id_register($Id, type =E<gt> 'real', font =E<gt> $font, id =E<gt> $fontname, priority =E<gt> $pri, hints =E<gt> join(' ', @_));
fr: defoma_id_register($Id, type =E<gt> 'real', font =E<gt> $police, id =E<gt> $nom_police, priority =E<gt> $pri, hints =E<gt> join(' ', @_));

source: foreach my $i (@alias) { defoma_id_register($Id, type =E<gt> 'alias', font =E<gt> $font, id =E<gt> $i, priority =E<gt> $pri, origin =E<gt> $fontname); }
fr: foreach my $i (@alias) { defoma_id_register($Id, type =E<gt> 'alias', font =E<gt> $police, id =E<gt> $i, priority =E<gt> $pri, origin =E<gt> $nom_police); }

source: # unregister ids. defoma_id_unregister($Id, type =E<gt> 'alias', font =E<gt> $font); defoma_id_unregister($Id, type =E<gt> 'real', font =E<gt> $font);
fr: # retire des identifiants. defoma_id_unregister($Id, type =E<gt> 'alias', font =E<gt> $police); defoma_id_unregister($Id, type =E<gt> 'real', font =E<gt> $police);

source: # close an id-cache defoma_id_close_cache($Id);
fr: # fermeture d'une base de référence defoma_id_close_cache($Id);

source: # get a list of indexes of installed fonts that have #'Helvetica' for the id. my @list = defoma_id_grep_cache($Id, 'installed', id =E<gt> 'Helvetica');
fr: # liste des index de polices ayant « Helvetica » comme identifiant. my @liste = defoma_id_grep_cache($Id, 'installed', id =E<gt> 'Helvetica');

source: defoma-reconfigure - Reconfigure all from zero.
fr: defoma-reconfigure - configure à nouveau les polices.

source: defoma-reconfigure reconfigures font configuration from zero. It fixes a critical bug of data loss, but also is used for reconfiguration of fonts.
fr: defoma-reconfigure configure à nouveau les polices, en reprenant tout à zéro. Ceci résout un bogue critique de perte de données et permet aussi de tout configurer.

source: defoma-reconfigure first removes almost all files and symlinks under /var/lib/defoma, to clean up all font configuration, and run defoma-app with update command. You should backup /var/lib/defoma if you put a important file there by yourself.
fr: B<defoma-reconfigure> supprime d'abord presque tous les fichiers de /var/lib/defoma pour effacer toutes les informations de configuration des polices, puis lance B<defoma-app> en lui demandant une mise à jour (commande update). Si vous avez vous-même placé un fichier important dans /var/lib/defoma, vous devriez sauvegarder ce répertoire avant de lancer defoma-reconfigure.

source: -f option is used to fix the data confusion which occurs when defoma is aborted.
fr: L'option -f est utilisée pour corriger une corruption de données produite par l'interruption brutale de defoma-app.

source: defoma-subst - Modify a rulefile of Defoma font substitution system.
fr: defoma-subst - modifie un fichier de règles du système de substitution de police de Defoma.

source: B<defoma-subst> [I<options>] B<new-rule> I<rulename [additional-lines...]>
fr: B<defoma-subst> [I<options>] B<new-rule> I<nom_règle [autres-lignes...]>

source: B<defoma-subst> [I<options>] B<edit-rule> I<rulename>
fr: B<defoma-subst> [I<options>] B<edit-rule> I<nom_règle>

source: B<defoma-subst> [I<options>] B<add-rule> I<rulename rules...>
fr: B<defoma-subst> [I<options>] B<add-rule> I<nom_règle règles...>

source: B<defoma-subst> [I<options>] B<remove-rule> I<rulename rules...>
fr: B<defoma-subst> [I<options>] B<remove-rule> I<nom_règle règles...>

source: B<defoma-subst> B<check-rule> I<rulename>
fr: B<defoma-subst> B<check-rule> I<nom_règle>

source: B<defoma-subst> is a tool to create/edit a rulefile of Defoma font substitution system. This system makes a certain font provide an user-specified id. Rulefile exists in order not only to specify such ids but also to have more similar fonts containing same characters substitute for the id.
fr: B<defoma-subst> permet de créer ou modifier un fichier de règles pour le système de substitution de Defoma. Celui-ci permet à certaines polices de fournir des identifiants spécifiés par un utilisateur. Les fichiers de règles existent non seulement pour spécifier ces identifiants, mais aussi pour avoir plus de polices similaires avec les mêmes identifiants de substitution.

source: Following is the form of rulefile.
fr: Voici un exemple de fichier de règles :

source: # comment.. # comment.. Helvetica --GeneralFamily SansSerif --Shape NoSerif \e Upright --Weight Medium --Charset,* ISO8859-1 Helvetica-Bold --GeneralFamily SansSerif --Shape NoSerif \e Upright --Weight Medium --Charset,* ISO8859-1
fr: # commentaire... # commentaire... Helvetica --GeneralFamily SansSerif --Shape NoSerif \e Upright --Weight Medium --Charset,* ISO8859-1 Helvetica-Bold --GeneralFamily SansSerif --Shape NoSerif \e Upright --Weight Medium --Charset,* ISO8859-1

source: In this example Helvetica and Helvetica-Bold are need-to-be-substituted ids, and following hints represent information of these two fonts. The asterisk added to Charset hinttype with comma means Charset is required to match.
fr: Dans cet exemple, Helvetica et Helvetica-Bold sont des identifiants qui doivent être substitués, et les indications suivantes représentent les informations sur ces deux polices. L'astérisque ajouté avec une virgule à l'indication de type « Charset » signifie que le codage doit correspondre exactement.

source: Create a new rulefile
fr: Crée un nouveau fichier de règles

source: I<rulename>.subst-rule
fr: I<nom_règle>.subst-rule

source: under
fr: dans
