Repository: debian-ports/defoma
Catalog: man/po4a/po/*.po
Languages: fr

source: B<get_xlfd_of_font> is a function to get an array of XLFDs of a font specified by I<font>. You can control the amount of gained XLFDs by I<level> and I<face> options. I<level> must be either of I<'min'>, I<'normal'>, or I<'max'>. When I<min> is specified, not-slanted not-boldized XLFDs registered in xfont category will be returned. When I<normal> is specified, XLFDs including boldized and/or slanted (but not reverse slanted) ones registered in xfont category will be returned. When I<max> is specified, all generated XLFDs will be returned.
fr: B<get_xlfd_of_font> permet d'obtenir un tableau de XLFD pour une police spécifiée par I<police>. Vous pouvez contrôler la quantité de XLFD obtenue avec les options I<niveau> et I<face>. Le I<niveau> doit être soit « I<min> », soit « I<normal> », ou encore « I<max> ». Lorsque I<min> est spécifié, les XLFD non italique ou gras enregistrés dans la catégorie « xfont » sont retournés. Lorsque I<normal> est spécifié, les XLFD étant gras ou italique (mais pas italique à l'envers) enregistrés dans la catégorie « xfont » sont retournés. Lorsque I<max> est spécifié, tous les XLFD générés sont retournés.

source: EXAMPLES
fr: EXEMPLES

source: defoma-font - register/unregister font(s) to Debian Font Manager
fr: defoma-font - inscrit ou désinscrit une police auprès du gestionnaire de polices Debian

source: B<defoma-font> [I<options>] B<register> I<category font hints...>
fr: B<defoma-font> [I<options>] B<register> I<catégorie police indications...>

source: B<defoma-font> [I<options>] B<unregister> I<category font>
fr: B<defoma-font> [I<options>] B<unregister> I<catégorie police>

source: B<defoma-font> [I<options>] B<reregister> I<category font hints...>
fr: B<defoma-font> [I<options>] B<reregister> I<catégorie police indications...>

source: B<defoma-font> [I<options>] B<purge> I<category font>
fr: B<defoma-font> [I<options>] B<purge> I<catégorie police>

source: B<defoma-font> [I<options>] B<register-all> I<hintfile>
fr: B<defoma-font> [I<options>] B<register-all> I<fichier_indications>

source: B<defoma-font> [I<options>] B<unregister-all> I<hintfile>
fr: B<defoma-font> [I<options>] B<unregister-all> I<fichier_indications>

source: B<defoma-font> [I<options>] B<reregister-all> I<hintfile>
fr: B<defoma-font> [I<options>] B<reregister-all> I<fichier_indications>

source: B<defoma-font> [I<options>] B<purge-all> I<hintfile>
fr: B<defoma-font> [I<options>] B<purge-all> I<fichier_indications>

source: B<defoma-font> is a tool to register or unregister font(s) to Defoma, Debian Font Manager. Defoma then calls Defoma-configuration-scripts provided by applications to make the font(s) configured for the applications which can make use of them. It is supposed to be called from postinst and prerm scripts, but may be called from console for not-packaged addon fonts.
fr: B<defoma-font> permet d'enregistrer ou de désenregistrer une police auprès de Defoma, le gestionnaire de polices Debian. Defoma appelle ensuite les scripts de configuration Defoma fournis par les applications pour configurer ces polices pour les applications qui peuvent les utiliser. Cet outil est censé être appelé par les scripts « postinst » et « prerm », mais peut aussi être appelé depuis une console pour ajouter des polices qui ne sont pas fournies par un paquet.

source: There are two methods of registering/unregistering font(s): by specifying one font with its hints, or through a I<hintfile> , which describes several fonts with their hints. Font packages may possibly use the latter method, installing a I<hintfile> under /etc/defoma/hints as conffile. The latter method has '-all' added in the commands.
fr: Il y a deux méthodes pour inscrire ou désinscrire une police : la police peut être spécifiée avec ses indications (« hints »), ou par l'intermédiaire d'un I<fichier d'indications> (« hintfile »), qui décrit plusieurs polices avec leurs indications. Les paquets de polices préféreront sûrement la deuxième méthode qui consiste à installer un I<fichier d'indications> dans /etc/defoma/hints en tant que fichier de configuration. Cette dernière méthode utilise les commandes suffixées de « -all ».

source: I<category> specifies the category of a font like type1, truetype and so on. I<font> specifies the font itself and is either a full path to the font, or a logical font name. I<hints> specify the hints of the font, which contain essential information of the font like FontName, Charset and Encoding, appearance information of the font representing its face like Weight, Shape, GeneralFamily and Width, and additional information of the font like Alias and Priority.
fr: I<catégorie> spécifie la catégorie d'une police, qui peut être « type1 », « truetype », etc. I<police> spécifie la police elle-même et peut être le chemin complet vers la police ou le nom logique de la police. I<indications> spécifie les indications d'une police, qui contiennent les informations essentielles de la police, telles que son nom (FontName), le jeu de caractères (Charset) et le codage (Encoding), des informations sur son apparence : graisse (Weight), forme (Shape), famille (GeneralFamily) et taille (Width), et aussi des informations supplémentaires comme un alias (Alias) ou une priorité (Priority).

source: Register the specified I<font> with the specified I<hints> into the specified I<category> unless the font is already registered.
fr: Déclare la I<police> spécifiée avec ses I<indications> dans la I<catégorie> spécifiée, à moins que la police ne soit déjà enregistrée.

source: Unregister the specified I<font> which must be already registered in the specified I<category>. If the font is marked as use or exclude in an Id cache of a certain application, the marks are left intact.
fr: Retire la I<police> spécifiée, qui doit avoir été enregistrée dans la I<catégorie> spécifiée. Si la police est marquée comme étant utilisée ou exclue (« exclude ») dans la base de référence (« id cache ») d'une application, la marque est laissée intacte.

source: If the specified I<font> is already registered, the registered hints and the specified I<hints> are compared. If these hints differs, the font first gets unregistered and then newly registered with the specified new hints. If the font is not registered, following process is the same as B<register> command.
fr: Si la police est déjà enregistrée, les indications enregistrées et les I<indications> spécifiées sont comparées. Si ces indications diffèrent, la police est dans un premier temps retirée, puis enregistrée de nouveau avec les indications spécifiées. Si la police n'est pas enregistrée, cette commande agit comme B<register>.

source: This command is almost the same as B<unregister> command, except that this command removes the marks in an Id cache.
fr: Cette commande est presque identique à B<unregister>, à la différence qu'elle retire les marques des bases de référence.

source: These commands operate all the fonts written in the specified I<hintfile>.
fr: Ces commandes opèrent sur toutes les polices spécifiées dans le I<fichier d'indications>.

source: More verbose output.
fr: Sortie encore plus bavarde.

source: defoma-font -vt register type1 /usr/share/fonts/type1/foo.pfa \e --FontName Helvetica --Charset ISO8859-1 --Weight Medium \e --Shape Upright NoSerif --GeneralFamily SansSerif defoma-font reregister-all /etc/defoma/hints/microsoft.hints
fr: defoma-font -vt register type1 /usr/share/fonts/type1/toto.pfa \e --FontName Helvetica --Charset ISO8859-1 --Weight Medium \e --Shape Upright NoSerif --GeneralFamily SansSerif defoma-font reregister-all /etc/defoma/hints/microsoft.hints

source: Defoma::Font - Defoma module to handle font and font-cache.
fr: Defoma::Font - module Defoma pour la gestion des polices et des caches de polices

source: defoma_font_register( I<category>, I<font>, I<hints...> );
fr: defoma_font_register( I<catégorie>, I<police>, I<indications...> );

source: defoma_font_unregister( I<category>, I<font> );
fr: defoma_font_unregister( I<catégorie>, I<police> );

source: defoma_font_reregister( I<category>, I<font>, I<hints...> );
fr: defoma_font_reregister( I<catégorie>, I<police>, I<indications...> );

source: defoma_font_if_register( I<category>, I<font> );
fr: defoma_font_if_register( I<catégorie>, I<police> );

source: @fonts = defoma_font_get_fonts( I<category> );
fr: @polices = defoma_font_get_fonts( I<catégorie> );

source: @hints = defoma_font_get_hints( I<category>, I<font> );
fr: @indications = defoma_font_get_hints( I<catégorie>, I<police> );

source: %failedapps = defoma_font_get_failed ( I<category>, I<font> );
fr: %echec_apps = defoma_font_get_failed ( I<catégorie>, I<police> );

source: Defoma::Font is a Defoma module to handle registration/unregistration of fonts and font-caches. It provides functions listed above which are supposed to be called from Defoma-configuration scripts when the scripts want to register/unregister a font, and need to retrieve the data recorded in a font-cache, which holds fonts and their hints.
fr: Defoma::Font est un module Defoma qui permet de gérer l'enregistrement et le désenregistrement de polices et de caches de polices. Il fournit les fonctions listées ci-dessous qui sont supposées être appelées dans les scripts de configuration Defoma lorsque les scripts veulent enregistrer ou désenregistrer une police, ou veulent récupérer les données contenues dans un cache de police (« font-cache »), qui contiennent des polices et leurs indications.

source: B<defoma_font_register> is a function used to register a specified I<font> into a specified I<category> with specified I<hints>. If the specified font is already registered, it returns non-zero. Otherwise the font and the hints are registered into the font-cache of the specified category, and further Defoma-configuration scripts get called which accept the specified category with register command.
fr: B<defoma_font_register> permet d'enregistrer une I<police> dans une I<catégorie> avec les I<indications> spécifiées. Si la I<police> est déjà enregistrée, la fonction renvoie une valeur non nulle. Sinon, la I<police> et ses I<indications> sont enregistrées dans le cache de polices de la I<catégorie> spécifiée, et les autres scripts de configuration Defoma qui acceptent la I<catégorie> spécifiée sont appelés avec la commande B<register>.

source: B<defoma_font_unregister> is a function used to unregister a specified I<font> from a specified I<category>. If the font is not registered in the category, it returns non-zero. Otherwise further Defoma-configuration scripts get called which accept the specified category with unregister command, and the font and the hints are removed from the font-cache of the category.
fr: B<defoma_font_unregister> permet de retirer une I<police> d'une certaine I<catégorie>. Si la I<police> n'est pas enregistrée dans la I<catégorie> spécifiée, elle retourne une valeur non nulle. Sinon, les autres scripts de configuration Defoma qui acceptent cette catégorie sont appelés avec la commande B<unregister>, et la police et ses indications sont retirées du cache de polices de la I<catégorie>.

source: B<defoma_font_reregister> is a function which actually calls I<defoma_font_unregister> and I<defoma_font_register> in order. If a specified I<font> if not registered in a specified I<category>, unregisteration is skipped. If the font is already registered in another category, it returns non-zero.
fr: B<defoma_font_reregister> rappelle I<defoma_font_unregister> et I<defoma_font_register> dans l'ordre. Si la I<police> spécifiée n'est pas enregistrée dans la I<catégorie>, l'étape de désenregistrement est passée. Si la I<police> est déjà enregistrée dans une autre I<catégorie>, cette fonction retourne une valeur non nulle.

source: B<defoma_font_if_register> if a function that checks if a specified I<font> is registered in a specified I<category>. If the font is registered, it returns non-zero. Otherwise it returns zero.
fr: B<defoma_font_if_register> permet de vérifier si une I<police> est enregistrée dans une I<catégorie>. Si la I<police> est enregistrée, elle retourne une valeur non nulle. Sinon, cette fonction retourne zéro.

source: B<defoma_font_get_fonts> is a function used to obtain a list of fonts reigstered in the specified I<category>. It returns a list of fonts in an array. (font1 font2 font3 ...)
fr: B<defoma_font_get_fonts> permet d'obtenir une liste de polices enregistrées dans la I<catégorie> spécifiée. Cette fonction retourne la liste des polices sous forme de tableau (« police1 police2 police3 ... »).

source: B<defoma_font_get_hints> is a function used to obtain hints of the specified I<font> registered in the specified I<category>. It returns a list of hints in an array.
fr: B<defoma_font_get_hints> permet d'obtenir les indications de la I<police> enregistrée dans la I<catégorie> spécifiée. Une liste d'indications sous forme de tableau est retournée.

source: B<defoma_font_get_failed> is a function used to obtain applications for which Defoma failed to configure the specified I<font>. It returns a hash whose keys are applications and whose values are error status.
fr: B<defoma_font_get_failed> permet d'obtenir les applications pour lesquelles Defoma n'a pas réussi à configurer la I<police> spécifiée. Cette fonction retourne une table de hachage dont les clés sont les applications et les valeurs sont les statuts d'erreur.

source: 1. Register 'Helvetica-Bold' in postscript category with hints.
fr: 1. Enregistrement de « Helvetica-Bold » dans la catégorie « postscript » avec des indications.

source: $font = 'Helvetica-Bold'; @hints = ('--Family', 'Helvetica', '--Weight', 'Bold', '--Charset', 'ISO8859-1);
fr: $police = 'Helvetica-Bold'; @indications = ('--Family', 'Helvetica', '--Weight', 'Bold', '--Charset', 'ISO8859-1);

source: defoma_font_register('postscript', $font, @hints);
fr: defoma_font_register('postscript', $police, @indications);

source: 2. Unregister 'foo.pfa' from type1 category.
fr: 2. Désenregistrement de « toto.pfa » de la catégorie « type1 ».

source: $font = '/usr/share/fonts/foo.pfa';
fr: $police = '/usr/share/fonts/toto.pfa';

source: defoma_font_unregister('type1', $font);
fr: defoma_font_unregister('type1', $police);

source: 3. Unregister 'foo.pfa' from type1 category if registered.
fr: 3. Désenregistrement de « toto.pfa » de la catégorie « type1 », s'il était enregistré.

source: if (defoma_font_if_register('type1', $font)) { defoma_font_unregister('type1', $font); }
fr: if (defoma_font_if_register('type1', $police)) { defoma_font_unregister('type1', $police); }

source: 4. Get a list of fonts and their hints.
fr: 4. Récupération d'une liste de polices et de leurs indications

source: %hash = (); @fonts = defoma_font_get_fonts('x-postscript'); foreach $font (@fonts) { $hash{$font} = []; @{$hash{$font}} = defoma_font_get_hints('x-postscript', $font); }
fr: %hash = (); @polices = defoma_font_get_fonts('x-postscript'); foreach $police (@polices) { $hash{$police} = []; @{$hash{$police}} = defoma_font_get_hints('x-postscript', $police); }

source: defoma-hints - generate font hints.
fr: defoma-hints - fabrique les fichiers d'indications de polices.

source: B<defoma-hints> [B<-c>] [B<--no-question>] I<category fonts...>
fr: B<defoma-hints> [B<-c>] [B<--no-question>] I<catégorie polices...>

source: B<defoma-hints> is a tool to help generating font hints. It asks various questions about the typeface of a font, reads information from a font file, and outputs the generated hints to STDOUT in a hintfile format.
fr: B<defoma-hints> est l'outil qui fabrique les fichiers d'indications de polices. Il pose diverses questions au sujet des types de caractères, extrait des données des fichiers de polices et affiche les indications sur la sortie standard, au format des fichiers d'indications.

source: Force text interface, even if $DISPLAY is set.
fr: Oblige l'utilisation d'une interface texte, même si la variable d'environnement $DISPLAY est positionnée.

source: Accept default hint choice without prompting.
fr: Accepte les choix d'indication par défaut, sans poser de question.

source: FILES
fr: FICHIERS

source: Perl libraries which are prepared for each category. These are category-specific hints-generating program.
fr: Bibliothèques Perl spécifiques à chaque catégorie de police, elles fabriquent les fichiers d'indications de cette catégorie.

source: 1. Create a hintfile named type1.hints for type1 fonts in /usr/share/fonts/type1.
fr: 1. Création du fichier d'indications type1.hints pour les polices de catégorie « type1 » contenues dans le répertoire /usr/share/fonts/type1.

source: defoma-id - Manage id-cache of Debian Font Manager
fr: defoma-id - gère une base de référence du gestionnaire de polices Debian.

source: B<defoma-id> [I<options>] B<list-cache> I<app>
fr: B<defoma-id> [I<options>] B<list-cache> I<application>

source: B<defoma-id> [I<options>] B<install> I<app/id-cache id font>
fr: B<defoma-id> [I<options>] B<install> I<application/base-de-référence identifiant police>

source: B<defoma-id> [I<options>] B<exclude> I<app/id-cache id font>
fr: B<defoma-id> [I<options>] B<exclude> I<application/base-de-référence identifiant police>

source: B<defoma-id> [I<options>] B<unset> I<app/id-cache id font>
fr: B<defoma-id> [I<options>] B<unset> I<application/base-de-référence identifiant police>

source: B<defoma-id> [I<options>] B<add-alias> I<app/id-cache id font alias>
fr: B<defoma-id> [I<options>] B<add-alias> I<application/base-de-référence identifiant police alias>

source: B<defoma-id> [I<options>] B<remove-alias> I<app/id-cache alias font>
fr: B<defoma-id> [I<options>] B<remove-alias> I<application/base-de-référence alias police>

source: B<defoma-id> is supposed to be invoked not from a command line, but from dfontmgr.
fr: B<defoma-id> est conçu pour être appelé par dfontmgr et non en ligne de commande.

source: Defoma::Id - Defoma module to handle Id cache.
fr: Defoma::Id - module Defoma pour la gestion des bases de référence.

source: $Id = defoma_id_open_cache( I<suffix>, I<package_name> );
fr: $Id = defoma_id_open_cache( I<suffixe>, I<nom_paquet> );

source: defoma_id_close_cache( I<id_object> );
fr: defoma_id_close_cache( I<id_objet> );

source: defoma_id_register( I<id_object>,
fr: defoma_id_register( I<id_objet>,

source: font =E<gt> I<font>,
fr: font =E<gt> I<police>,

source: id =E<gt> I<id>,
fr: id =E<gt> I<identifiant>,

source: priority =E<gt> I<priority>,
fr: priority =E<gt> I<priorité>,

source: category =E<gt> I<category>,
fr: category =E<gt> I<catégorie>,

source: origin =E<gt> I<origin>,
fr: origin =E<gt> I<origine>,

source: depend =E<gt> I<depend>,
fr: depend =E<gt> I<dépendance>,

source: hints =E<gt> I<hints> );
fr: hints =E<gt> I<indications> );

source: defoma_id_unregister( I<id_object>,
fr: defoma_id_unregister( I<id_objet>,

source: id =E<gt> I<id> );
fr: id =E<gt> I<identifiant> );

source: @index = defoma_id_grep_cache( I<id_object>, I<search-type>,
fr: @index = defoma_id_grep_cache( I<id_objet>, I<type-recherché>,

source: @hints = defoma_id_get_hints( I<id_object>, I<index> );
fr: @hints = defoma_id_get_hints( I<id_objet>, I<index> );

source: defoma_id_set( I<id_object>, I<id>, I<font>, I<flag> );
fr: defoma_id_set( I<id_objet>, I<identifiant>, I<police>, I<flag> );

source: defoma_id_unset( I<id_object>, I<id>, I<font> );
fr: defoma_id_unset( I<id_objet>, I<identifiant>, I<police> );

source: Defoma::Id is a Defoma module to handle identifiers of fonts and id-caches. It provides functions listed above which are supposed to be called from Defoma-configuration scripts.
fr: Defoma::Id est un module Defoma pour la gestion des identifiants de police et des bases de référence. Il fournit les fonctions listées ci-dessous, qui sont supposées être appelées par les scripts de configuration Defoma.

source: id-cache is sort of a database and its aim is to avoid name space conflict. Applications often access fonts through their identifiers, so it is desirable that one identifier point only one font. It is a difficult requirement for automatic configuration because it can easily happen that two or more fonts have the same identifier. Automatic configuration scripts can hardly detect which font is the best to be named the identifier, or even such a situation occur. Defoma::Id is help for this problem.
fr: Une base de référence est une sorte de base de données dont le but est d'éviter les conflits de noms. Les applications accèdent souvent aux polices avec leurs propres identifiants, il est donc préférable qu'un identifiant pointe vers une seule police. C'est une contrainte importante pour une configuration automatique, parce qu'il peut facilement arriver que plusieurs polices aient le même identifiant. Les scripts de configuration automatique peuvent difficilement détecter quelle est la meilleure police pour porter le nom d'un identifiant, ou même pour savoir si cette situation se produit. Defoma::Id est une aide pour résoudre ce type de problème.

source: The rough flow of how Defoma::Id works is:
fr: Voici comment Defoma::Id fonctionne dans les grandes lignes :

source: 1. open an id-cache at I<init> command of a Defoma-configuration script.
fr: 1. Ouverture d'une base de référence avec la commande I<init> d'un script de configuration Defoma.

source: 2. register identifier(s) of a font at I<register> command of the script.
fr: 2. Enregistrement de(s) l'identifiant(s) pour une police avec la commande I<register> du script.

source: 3. Defoma::Id looks up the id-cache to check if there's any other font that has the same identifier, and calls back the script to make the most appropriate font have the identifier, by do-install- command and do-remove- command.
fr: 3. Recherche dans la base de référence par Defoma::Id pour vérifier si une autre police fournit le même identifiant, et rappel du script afin de faire le choix le plus approprié de la police qui fournira l'identifiant, à l'aide des commandes do-install- et do-remove-.

source: TYPE OF IDENTIFIER
fr: TYPE D'IDENTIFIANTS

source: It can handle three types of identifiers: RealName, Alias, and Substituted.
fr: Il peut gérer trois types d'identifiants : RealName, Alias et Substituted.

source: I<RealName> is a real name of a font and is usually taken from the FontName hint. If you want to register a font to an id-cache, at least one RealName must be registered. You can pass the hints to I<options> when you register a RealName.
fr: I<RealName> est le nom réel d'une police et est généralement pris dans l'indication FontName. Si vous voulez enregistrer une police à une base de références, au moins un nom réel doit être enregistré. Vous pouvez fournir les indications aux I<options> lorsque vous enregistrez un RealName.

source: I<Alias> is another name of a font and is usually taken from the Alias hint. You have to specify the RealName of the font with I<origin> when you register an Alias.
fr: I<Alias> est un autre nom pour une police, qui est généralement pris dans l'indication Alias. Vous devez spécifier le nom réel (RealName) de la police avec le paramètre I<origine> lorsque vous enregistrez un Alias.
